Documents/бит_Предупреждение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_Предупреждение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ПредупрежденияЖильцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинСуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма с учетом переплат. Фактическая сумма долга. Без пени.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезПереплат</Name>
							<Comment>Сумма без учета переплат по услугам в разрезе ЛС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Comment>Сумма начисленной пени</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_Предупреждение/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

&Наклиенте
Процедура ЗадатьВопросНаОчисткуТабЧасти(НачальноеЗначение, ВыбранноеЗначение)
	
	Если НачальноеЗначение <> ВыбранноеЗначение Тогда
		
		Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
			
			Ответ = Неопределено;

			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВыбранноеЗначение",ВыбранноеЗначение);
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗадатьВопросНаОчисткуТабЧастиЗавершение", ЭтотОбъект,ДополнительныеПараметры), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			Объект.ОбъектВыбора = ВыбранноеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&Наклиенте
Процедура ЗадатьВопросНаОчисткуТабЧастиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
	
	ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
	
    Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.ОбъектВыбора = ВыбранноеЗначение;
		Объект.ЛицевыеСчета.Очистить();
        
    КонецЕсли;

КонецПроцедуры

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// БИТ ЖКХ 14.01.2020
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.Печать.
	//УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаПечать);
	// Конец СтандартныеПодсистемы.Печать.
	Элементы.ГруппаПечать.Вид = ВидГруппыФормы.Подменю;
	
КонецПроцедуры

// СтандартныеПодсистемы.Печать.
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
    УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНадписьМоментРасчета.Заголовок = "Дата расчета долгов: " + Формат(Объект.МоментРасчета,"ДФ='dd.MM.yyyy ""г.""'");
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	РассчитатьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ЛицевыеСчета.Очистить();
	
	РассчитатьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьФрагмент()
	
	Перем ЗаполненоОрганизация;
	
	ЗаполненоОрганизация = ЗначениеЗаполнено(Объект.Организация);
	
	РассчитатьНаСервере(ЗаполненоОрганизация);
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПредупреждения(Команда)
	
	Результат = Сформировать("ПечатьПредупреждения");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_Предупреждение"
	,"Предупреждение"
	,"Предупреждение"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьРассылку(Команда)
	
	Если НЕ Объект.Проведен ИЛИ Модифицированность Тогда
		ТекстСообщения = НСтр( "ru = 'Проведите документ перед выполнение рассылки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РассылкаЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ссылка", Объект.Ссылка);
	ОткрытьФорму("Документ.бит_Предупреждение.Форма.ФормаРассылки",
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РассылкаЗавершение(Знач РезультатРедактирования, Знач ДополнительныеПараметры) Экспорт
	//
	//Если НЕ ПустаяСтрока(РезультатРедактирования) Тогда
	//	ЗаполнитьНачисленияПересчитатьНалог(РезультатРедактирования);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета.Очистить();
	
	Объект.ОбъектВыбора = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыбораПриИзменении(Элемент)
	
	Объект.ЛицевыеСчета.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокТипов = ПолучитьСписокТиповНаСервере();
	
	ВыбранныйЭлемент = Неопределено;
	
	ЭтаФорма.ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ОбъектВыбораНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), СписокТипов, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыбораНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	Если ВыбранныйЭлемент = Неопределено Тогда // Отказ от выбора.
		
		Возврат;
		
	КонецЕсли;
	
	ВыбранныйТип = ВыбранныйЭлемент.Значение;
	
	ТипФормы = "Справочник." + ВыбранныйТип + ".Форма.ФормаВыбораУправляемая";
	
	Отбор = Новый Структура;
	
	Если НЕ Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") Тогда
		
		Отбор.Вставить("Организация", Объект.Организация);
		
	КонецЕсли; 
	
	ОткрытьФорму(ТипФормы, Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектВыбораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗадатьВопросНаОчисткуТабЧасти(Объект.ОбъектВыбора, ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура подготовки списка ЛС для дальнейшего заполнения 
// табличной части документа ЛицевыеСчета.
&НаСервере
Процедура СформироватьСписокЛСдляТЧ(ПолныйСписок)
	
	Если ЗначениеЗаполнено(ПолныйСписок) Тогда
		
		// Удаление строк с ЛС, которые не имеют долгов.
		Счетчик = ПолныйСписок.Строки.Количество()-1;
		
		Пока Счетчик >= 0 Цикл
			
			Если ((НЕ ЗначениеЗаполнено(ПолныйСписок.Строки[Счетчик].СуммаБезПереплат) ИЛИ ПолныйСписок.Строки[Счетчик].СуммаБезПереплат <=0) 
				И (НЕ ЗначениеЗаполнено(ПолныйСписок.Строки[Счетчик].Сумма) ИЛИ ПолныйСписок.Строки[Счетчик].Сумма <=0) 
				И (НЕ ЗначениеЗаполнено(ПолныйСписок.Строки[Счетчик].СуммаПени) ИЛИ ПолныйСписок.Строки[Счетчик].СуммаПени <= 0 )) Тогда
				
				ПолныйСписок.Строки.Удалить(ПолныйСписок.Строки[Счетчик]);
				
			ИначеЕсли ПолныйСписок.Строки[Счетчик].Сумма < Объект.МинСуммаДолга Тогда
				
				ПолныйСписок.Строки.Удалить(ПолныйСписок.Строки[Счетчик]);
				
			КонецЕсли;
			
			Счетчик = Счетчик - 1;
			
		КонецЦикла;
		
		ПолныйСписок.Строки.Сортировать("ЛицевойСчет Возр");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТиповНаСервере();
	
	МассивТипов = Объект.Ссылка.Метаданные().Реквизиты["ОбъектВыбора"].Тип.Типы();	
	
	СписокТипов = Новый СписокЗначений;
	
	Для каждого ЭлементМассива Из МассивТипов Цикл
		
		ПустоеЗначение = Новый(ЭлементМассива);
		
		ОбъектОписанияМетаданных = ПустоеЗначение.Метаданные();
		
		СписокТипов.Добавить(ОбъектОписанияМетаданных.Имя, ОбъектОписанияМетаданных.Представление());
		
	КонецЦикла;
	
	Возврат СписокТипов;
	
КонецФункции

&НаСервере
Процедура РассчитатьНаСервере(Знач ЗаполненоОрганизация)
	
	Если ЗаполненоОрганизация Тогда
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		МоментРасчета = ДокументОбъект.ПолучитьДатуДолга(Объект.Организация, ?(ЗначениеЗаполнено(Объект.ДатаРасчета), Объект.ДатаРасчета, Объект.Дата));
		
		ЗначениеВДанныеФормы(ДокументОбъект, Объект);
		
		Элементы.ФормаНадписьМоментРасчета.Заголовок = "Дата расчета долгов: " + Формат(МоментРасчета, "ДФ='dd.MM.yyyy ""г.""'");
		
		Если ТипЗнч(Объект.ОбъектВыбора) = Тип("СправочникСсылка.бит_ЛицевыеСчета")
			И НЕ Объект.ОбъектВыбора = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка") Тогда
			
			ЛС = Объект.ОбъектВыбора;
			
			ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
			
			СписокЛС = ДокументОбъект.ПолучитьСписокЛС( , , ЛС);
			
			ЗначениеВДанныеФормы(ДокументОбъект, Объект);
			
		ИначеЕсли ТипЗнч(Объект.ОбъектВыбора) = Тип("СправочникСсылка.бит_СписокЗданий") Тогда
			
			Здание = Объект.ОбъектВыбора;
			
			Если ЗначениеЗаполнено(Объект.Организация) Тогда
				
				ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
				
				СписокЛС = ДокументОбъект.ПолучитьСписокЛС(Здание, Истина);
				
				ЗначениеВДанныеФормы(ДокументОбъект, Объект);
				
			КонецЕсли;
			
		Иначе
			
			ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
			
			СписокЗданий = ДокументОбъект.ПолучитьСписокЗданий(Объект.Организация);
			СписокЛС     = ДокументОбъект.ПолучитьСписокЛС(СписокЗданий, Ложь);
			
			ЗначениеВДанныеФормы(ДокументОбъект, Объект);
			
		КонецЕсли;
		
		// Количество ЛС по настройкам.
		КолВоЛС = СписокЛС.Количество();         
		
		Если (СписокЛС <> Неопределено ИЛИ КолВоЛС <> 0) И ЗаполненоОрганизация  Тогда
			
			// Список ЛС со всеми данными.
			ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
			

			// БИТ ЖКХ 25.06.2020
			ПолныйСписок = ДокументОбъект.РасчитатьДолги(СписокЛС, МоментРасчета, Объект.ДатаРасчета);//МоментРасчета);
//			ПолныйСписок = ДокументОбъект.РасчитатьДолги(СписокЛС, МоментРасчета);
			

			ЗначениеВДанныеФормы(ДокументОбъект, Объект);
			
			СформироватьСписокЛСдляТЧ(ПолныйСписок);
			
			Для каждого Строка Из ПолныйСписок.Строки Цикл
				
				ТекущаяСтрока = Объект.ЛицевыеСчета.Добавить();
				
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Строка);
				
			КонецЦикла; 
			
		КонецЕсли;
		
		Если Объект.ЛицевыеСчета.Количество() =  0 Тогда
			
			Если КолВоЛС = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "По данным настройкам лицевых счетов нет!";
				Сообщение.Сообщить();
				
			ИначеЕсли Объект.МинСуммаДолга > 0  Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Нет лицевых счетов, по которым есть долги более чем на " + Объект.МинСуммаДолга + " руб.!";
				Сообщение.Сообщить();
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Нет лицевых счетов, по которым есть долги!";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли; 
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Проверьте заполнение поля: Организация";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры

// Cлужебная процедура для заполнения колонки "Адрес" табличного поля "СписокЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиАдрес()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",Объект.ЛицевыеСчета.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из Объект.ЛицевыеСчета Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчет,"ЛицевойСчет") Тогда
			
			Стр.Адрес = Строка(Выборка.УлицаЛицевогоСчета) + ", д. " + Строка(Выборка.Здание) + ?(ПустаяСтрока(Выборка.Корпус),"",", кор. " + Строка(Выборка.Корпус)) + ", кв. " + Строка(Выборка.Квартира);
			
		Иначе
			
			Стр.Адрес = "";
			
		КонецЕсли;
		
		Выборка.Сбросить();
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта"                   , Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"                            , Объект.Организация);
	КэшированныеЗначения.Вставить("Дата"                                   , Объект.Дата);
	КэшированныеЗначения.Вставить("мВыводитьСуммуБезУчетаПереплатПоУслугам", Неопределено);
	КэшированныеЗначения.Вставить("мВключатьВРасчетСуммыДолгаПени"         , Неопределено);
	
КонецПроцедуры

&НаСервере
Функция Сформировать(ИмяМакета)
	
	Если ИмяМакета = "ПечатьПредупреждения" Тогда
		
		ТабДокумент = ПечатьПредупрежденияФункция();
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой сличительной ведомости
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
&НаСервере
Функция ПечатьПредупрежденияФункция()
	
	ОбновитьНастройкиЖКХ();
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	Макет = ДокументОбъект.ПолучитьМакет("Предупреждение");
	
	ТабДокумент   = Новый ТабличныйДокумент();
	
	ТабДокумент.КлючПараметровПечати = "МакетПредупреждения";
	
	ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
	
	Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Объект.Организация, Объект.Дата);
	
	СтруктураПечати = Новый Структура();
	
	СтруктураПечати.Вставить("Организация"          ,Объект.Организация.Наименование);
	СтруктураПечати.Вставить("ФИОРуководителя"      ,Руководители.Руководитель);
	СтруктураПечати.Вставить("ДолжностьРуководителя",Руководители.РуководительДолжность);
	СтруктураПечати.Вставить("СрокПогашения"        ,Формат(Объект.СрокПогашения, "ДФ='dd MMMM yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(Объект.ДатаРасчета) Тогда
		
		ДатаПросмотра = Объект.ДатаРасчета;
		
	Иначе
		
		ДатаПросмотра = Объект.Дата;
		
	КонецЕсли;
	
	СтруктураПечати.Вставить("ДатаПросмотра", Формат(ДатаПросмотра, "ДФ='dd MMMM yyyy ""г.""'"));
	
	ФормСтрока  = "Л = ru_RU; ДП = Истина";
	ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Для каждого Строка ИЗ Объект.ЛицевыеСчета Цикл
		
		СтруктураПечати.Вставить("ФИО",   Строка.ОтветственноеЛицо);
		СтруктураПечати.Вставить("Адрес", Строка.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(Строка.ЛицевойСчет.Квартира),", кв. " + Строка(Строка.ЛицевойСчет.Квартира),""));
		
		Если НЕ мКэшЗначений.мВыводитьСуммуБезУчетаПереплатПоУслугам Тогда
			
			Сумма = Строка.Сумма;
			
		Иначе
			
			Сумма = Строка.СуммаБезПереплат;
			
		КонецЕсли;
		
		Если мКэшЗначений.мВключатьВРасчетСуммыДолгаПени Тогда
			
			Сумма = Сумма + Строка.СуммаПени;
			
		КонецЕсли;
		
		СуммаПрописью = ЧислоПрописью(Сумма,ФормСтрока, ПарПредмета);
		
		СтруктураПечати.Вставить("Сумма"        , Сумма);
		СтруктураПечати.Вставить("СуммаПрописью", СуммаПрописью);
		
		ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
		
		ШапкаОбласть.Параметры.Заполнить(СтруктураПечати);
		
		Для Каждого ТекПараметр Из СтруктураПечати Цикл
			
			Пока НайтиИЗаменитьВДокументе(ШапкаОбласть, "[" + ТекПараметр.Ключ + "]", ТекПараметр.Значение) Цикл
				
			КонецЦикла;
			
		КонецЦикла;
		
		СтрокаПредупреждения = Новый Массив;
		
		СтрокаПредупреждения.Добавить(ШапкаОбласть);
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаПредупреждения) Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ШапкаОбласть);
		
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати      = ТабДокумент.Область(1, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ПолеСверху         = 0;
	ТабДокумент.ПолеСлева          = 0;
	ТабДокумент.ПолеСнизу          = 0;
	ТабДокумент.ПолеСправа         = 0;
	
	Возврат ТабДокумент;
	
КонецФункции

// Производит замену строк в указанном табличном документе.
//
// Возвращаемое значение:
//  Булево – была ли произведена замена.
//
&НаСервере
Функция НайтиИЗаменитьВДокументе(ТабДок, СтрокаПоиска, СтрокаЗамены)
	
	ОбластьЗамены = ТабДок.НайтиТекст(СтрокаПоиска);
	
	Если ОбластьЗамены = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОбластьЗамены.Текст = СтрЗаменить(ОбластьЗамены.Текст, СтрокаПоиска, СтрокаЗамены);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьНастройкиЖКХ()
		  
  ПараметрыЖКХ = Новый Структура;
		  
  ПараметрыЖКХ.Вставить("ВыводитьСуммуБезУчетаПереплатПоУслугам", Ложь);
  ПараметрыЖКХ.Вставить("ВключатьВРасчетСуммыДолгаПени"         , Ложь);
		  
  бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Объект.Дата, Объект.Организация, ПараметрыЖКХ);
		  
  мКэшЗначений.мВыводитьСуммуБезУчетаПереплатПоУслугам = ПараметрыЖКХ.ВыводитьСуммуБезУчетаПереплатПоУслугам;
  мКэшЗначений.мВключатьВРасчетСуммыДолгаПени          = ПараметрыЖКХ.ВключатьВРасчетСуммыДолгаПени;
		  
КонецПроцедуры

// БИТ ЖКХ 22.12.2020
&НаКлиенте
Функция ПечатьНапоминания(Команда)
	
	Результат = ПечатьНапоминанияНаСервере();
	
//	Результат = Сформировать("ПечатьПредупреждения");
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_Предупреждение"
	,"Предупреждение"
	,"Предупреждение"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);

КонецФункции

// БИТ ЖКХ 22.12.2020
&НаСервере
Функция ПечатьНапоминанияНаСервере()
	ОбновитьНастройкиЖКХ();
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	Макет = ДокументОбъект.ПолучитьМакет("Напоминание");
	
	ТабДокумент   = Новый ТабличныйДокумент();
	
	ТабДокумент.КлючПараметровПечати = "МакетПредупреждения";
	
	ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
	
	Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Объект.Организация, Объект.Дата);
	
	СтруктураПечати = Новый Структура();
	
	СтруктураПечати.Вставить("Организация"          ,Объект.Организация.Наименование);
	СтруктураПечати.Вставить("ФИОРуководителя"      ,Руководители.Руководитель);
	СтруктураПечати.Вставить("ДолжностьРуководителя",Руководители.РуководительДолжность);
	СтруктураПечати.Вставить("СрокПогашения"        ,Формат(Объект.СрокПогашения, "ДФ='dd MMMM yyyy ""г.""'"));
	
	//Если ЗначениеЗаполнено(Объект.ДатаРасчета) Тогда
	//	
	//	ДатаПросмотра = Объект.ДатаРасчета;
	//	
	//Иначе
	//	
	//	ДатаПросмотра = Объект.Дата;
	//	
	//КонецЕсли;
	ДатаПросмотра = Объект.Дата;
	
	СтруктураПечати.Вставить("ДатаПросмотра", Формат(ДатаПросмотра, "ДФ='dd MMMM yyyy ""г.""'"));
	
	ФормСтрока  = "Л = ru_RU; ДП = Истина";
	ПарПредмета = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Для каждого Строка ИЗ Объект.ЛицевыеСчета Цикл
		
		СтруктураПечати.Вставить("ФИО",   Строка.ОтветственноеЛицо);
		СтруктураПечати.Вставить("Адрес", Строка.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(Строка.ЛицевойСчет.Квартира),", кв. " + Строка(Строка.ЛицевойСчет.Квартира),""));
		
		Если НЕ мКэшЗначений.мВыводитьСуммуБезУчетаПереплатПоУслугам Тогда
			
			Сумма = Строка.Сумма;
			
		Иначе
			
			Сумма = Строка.СуммаБезПереплат;
			
		КонецЕсли;
		
		Если мКэшЗначений.мВключатьВРасчетСуммыДолгаПени Тогда
			
			Сумма = Сумма + Строка.СуммаПени;
			
		КонецЕсли;
		
		СуммаПрописью = ЧислоПрописью(Сумма,ФормСтрока, ПарПредмета);
		
		СтруктураПечати.Вставить("Сумма"        , Сумма);
		СтруктураПечати.Вставить("СуммаПрописью", СуммаПрописью);
		
		ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
		
		ШапкаОбласть.Параметры.Заполнить(СтруктураПечати);
		
		Для Каждого ТекПараметр Из СтруктураПечати Цикл
			
			Пока НайтиИЗаменитьВДокументе(ШапкаОбласть, "[" + ТекПараметр.Ключ + "]", ТекПараметр.Значение) Цикл
				
			КонецЦикла;
			
		КонецЦикла;
		
		СтрокаПредупреждения = Новый Массив;
		
		СтрокаПредупреждения.Добавить(ШапкаОбласть);
		
		Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаПредупреждения) Тогда
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ШапкаОбласть);
		
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати      = ТабДокумент.Область(1, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ПолеСверху         = 0;
	ТабДокумент.ПолеСлева          = 0;
	ТабДокумент.ПолеСнизу          = 0;
	ТабДокумент.ПолеСправа         = 0;
	
	Возврат ТабДокумент;

КонецФункции

#КонецОбласти
